---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.FailedToSetWorkplane
source: html/c225b987-3ca3-4fa8-0d75-dcd829efc59e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.FailedToSetWorkplane Property

Could not set Work Plane of [Import].\n\nPlease use the Work Plane tool to set a Work Plane for this view.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToSetWorkplane { get; }
```